docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!--  -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pankaj Jangid</title>
<meta name="author" content="Pankaj Jangid" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/main.css" />

<link rel="canonical" href="https://jangid.info/"/>
<meta name="description" content="Notes by Pankaj Jangid on software engineering, entrepreneurship, governance, and the craft of building products, teams, and systems -- an archive that spans over two decades of writing."/>
<meta property="og:type" content="website"/>
<meta property="og:site_name" content="Pankaj Jangid"/>
<meta property="og:title" content="Pankaj Jangid"/>
<meta property="og:description" content="Notes by Pankaj Jangid on software engineering, entrepreneurship, governance, and the craft of building products, teams, and systems -- an archive that spans over two decades of writing."/>
<meta property="og:url" content="https://jangid.info/"/>
<meta name="twitter:card" content="summary"/>
<meta name="twitter:site" content="@jangid"/>
<meta name="twitter:title" content="Pankaj Jangid"/>
<meta name="twitter:description" content="Notes by Pankaj Jangid on software engineering, entrepreneurship, governance, and the craft of building products, teams, and systems -- an archive that spans over two decades of writing."/>
<link rel="icon" type="image/svg+xml" href="/favicon.svg"/>
<link rel="alternate" type="application/rss+xml" title="Pankaj Jangid — Notes" href="/notes/feed.xml"/>
</head>
<body>
<div id="preamble" class="status">
<nav class="site-nav"><a href="/">Home</a><a href="/notes/">Notes</a></nav>
</div>
<div id="content" class="content">
<h1 class="title">Pankaj Jangid
<br />
<span class="subtitle">Notes on software, entrepreneurship, and how we are governed.</span>
</h1>
<p>
I co-founded <a href="https://optimizory.com/">Optimizory</a> and <a href="https://alphafi.xyz/">AlphaFi</a>. Most of what I write is
grounded in India, even when I'm writing it from somewhere else.
</p>

<p>
This is where I write &ndash; long-form when the thought needs it,
shorter when it doesn't. Everything here is written in Emacs, which
is as much the point as the content.
</p>

<p>
Email me at <a href="mailto:pankaj@jangid.info">pankaj@jangid.info</a>. You can also find me on <a href="https://x.com/jangid">X</a>,
<a href="https://www.linkedin.com/in/pankaj-jangid/">LinkedIn</a>, and <a href="https://github.com/jangid">GitHub</a>.
</p>

<p>
Head to <a href="notes/index.html">Notes</a> for the archive.
</p>

<p>
Recent:
</p>

<ol class="org-ol">
<li><a href="notes/claude-code-sandbox-macos.html">Sandboxing Claude Code on macOS: Seatbelt + Privoxy</a></li>
<li><a href="notes/space-sector-processes.html">Process Discipline in India's Space Sector</a></li>
</ol>
</div>
<div id="postamble" class="status">
<div class="site-footer"><span><a href="mailto:pankaj@jangid.info">pankaj@jangid.info</a></span><span class="sep">·</span><span><a href="https://x.com/jangid" rel="me">X</a></span><span class="sep">·</span><span><a href="https://www.linkedin.com/in/pankaj-jangid/" rel="me">LinkedIn</a></span><span class="sep">·</span><span><a href="https://github.com/jangid" rel="me">GitHub</a></span></div><div class="legal">&copy; 2005&ndash;2026 Pankaj Jangid. Prose licensed under <a href="https://creativecommons.org/licenses/by/4.0/">CC BY 4.0</a>; code snippets under the MIT License.</div>
</div>
</body>
</html>
